In [70]:
import pandas as pd 
import numpy as np

### 2.1

In [71]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
                    'londON_StockhOlm',
                    'Budapest_PaRis', 'Brussels_londOn'],
                    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                    '12. Air France', '"Swiss Air"']})

In [72]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [73]:
for i in range(0, len(df)):
    if pd.isna(df.loc[i, 'FlightNumber']):
        df.loc[i, 'FlightNumber'] = df.loc[i-1, 'FlightNumber'] + 10

In [74]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [75]:
df['FlightNumber'] = df['FlightNumber'].astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  5 non-null      int32
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: int32(1), object(3)
memory usage: 268.0+ bytes

## 2.2

In [76]:
new_df = df['From_To'].str.split("_", n = 1, expand = True)

In [77]:
new_df.columns = ['From', 'To']
new_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

## 2.3

In [78]:
new_df['From'] = new_df['From'].str.capitalize()
new_df['To'] = new_df['To'].str.capitalize()
new_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

## 2.4

In [80]:
df.drop('From_To', axis=1, inplace=True)
df = pd.concat([df, new_df], axis=1)
df

,FlightNumber,RecentDelays,Airline,From,To,From,To
0,10045,"[23, 47]",KLM(!),London,Paris,London,Paris
1,10055,[],<Air France> (12),Madrid,Milan,Madrid,Milan
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,London,Stockholm
3,10075,[13],12. Air France,Budapest,Paris,Budapest,Paris
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,Brussels,London

## 2.5

In [108]:
for i in range(len(df)):
    for j in range(len(df.loc[i, 'RecentDelays'])):
        df.loc[i, 'delay_'+str(j+1)] = df.loc[i, 'RecentDelays'][0]

In [110]:
df.drop('RecentDelays', axis=1, inplace=True)

In [111]:
df

,FlightNumber,Airline,From,To,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,London,Paris,23.0,23.0,NaN
1,10055,<Air France> (12),Madrid,Milan,Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,London,Stockholm,24.0,24.0,24.0
3,10075,12. Air France,Budapest,Paris,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,Brussels,London,67.0,67.0,NaN